<template>
  <q-tabs>
    <!-- Tabs - notice slot="title" -->
    <q-tab default slot="title" label="证明类" name="tab-1" />
    <q-tab slot="title" name="tab-2" label="事务类" />
    <q-tab slot="title" name="tab-3" label="场地租借" />
    <q-tab-pane v-for="i in 3" :name="`tab-${i}`" :key="i" class="no-padding">
      <q-list no-border separator>
        <q-collapsible v-for="issue in issues[i-1]" :label="issue.name" :key="issue.name">
          <div v-html="issue.detail">
          </div>
        </q-collapsible>
      </q-list>
    </q-tab-pane>
  </q-tabs>
</template>

<script>
export default {
  data() {
    return {
      issues: [
        [
          {
            name: '在读证明',
            detail: `携带本人学生证或身份证至以下地点办理：
                      <br/>
                      <br/>
                      <b>宝山校区: </b><br/>
                      A400学生服务中心4号窗口    窗口电话: 021-66131828
                      <br/>
                      学生助理有课不在时，办理在读证明请前往A408
                      <br/>
                      <b>延长校区: </b>行健楼224室    电话: 021-56331343
                      <br/>
                      <b>嘉定校区: </b>综合楼511    电话: 021-69980039
                      <br />
                      <br/>
                      注意：学生在读证明不予代开,若有特殊情况，本人不能到校，请代为开具的同学持至少两种申请人的身份证明(如学生证，学生证副卡，身份证等)
                  `
          },
          {
            name: '居住证明',
            detail: ` 请前往校本部A400学生服务中心15号窗口办理：<br/>
                      请同学先前往武保处网站下载相关表格，填写完成后在15号窗口进行信息审核与盖章<br/>
                      窗口电话：021-66135339<br/>
                      注意：居住证明办理只限宝山校区(校本部)住宿学生，其他校区或已退宿学生不予办理`
          },
          {
            name: '成绩证明',
            detail: `<br/>
                      在校本科生成绩大表，成绩排名证明，请前往校本部行政楼401找相关老师办理<br/>
                      电话: 021-66132131 <br/>
                      注意: 成绩证明办理请先在学生所在学院教务办公室签字盖章`
          },
          {
            name: '创新项目立项，结题证明',
            detail: ` 请至行政楼306找相关老师办理<br/>
                      窗口电话: 021-66132131转603 <br/>
                      注意：结题证明开具需学院已将相关结题材料上交后进行`
          },
          {
            name: '婚育证明',
            detail: `  每年3-6月，请前往校本部A400学生服务中心1-3号窗口办理：<br/>
                      电话: 021-66135259<br/>
                      其他时间请至行政楼411找相关老师办理<br/>
                      电话: 021-66134532转802`
          },
          {
            name: '户籍证明',
            detail: ` 集体户口学生，因私需公安机关出具《户籍证明》，由本人填写申请表（须在申请表中填写事由和用途，如申办护照、出国签证、边境出入证、就业、结婚、公证等），请辅导员老师或导师签名认可并加盖学院公章，同时需开具在读证明，后持本人身份证、申请表、在读证明，在保卫处“窗口”申领《户籍证明》介绍信，最后携带本人身份证、保卫处出具的《户籍证明》介绍信和在读证明，到集体户口管辖地区公安派出所办理《户籍证明》。申请表可在武保处网站服务指南板块里下载也可在武保处领取。
                      <br />
                      <b>宝山校区</b>：集体户口管辖地区公安派出所：祁连派出所（锦秋路1281号）
                      <br />
                      <b>嘉定校区</b>：集体户口管辖地区公安派出所：嘉城派出所（塔城路555号）。
                      <br />
                      <b>延长校区</b>：集体户口管辖地区公安派出所：大宁派出所（彭江路200号）。还需携带身份证复印件。
                      <br />
                      保卫处咨询电话：
                      <br />
                      <b>宝山校区</b>：66132610，66134278
                      <br />
                      <b>嘉定校区</b>：69982395，69982400
                      <br />
                      <b>延长校区</b>：56331897
                      <br />
                      网址http://www.wubaochu.shu.edu.cn/Default.aspx
                      <br />`
          }
        ],
        [
          {
            name: '毕业生协议书鉴定',
            detail: `  前往校本部A400学生服务中心5号窗口办理：<br/>
                      请先在网上填写电子协议书 <br/>
                      电子协议书输入流程:<br/>
                          (1) 进入上海大学就业网 <br/>
                          (2) 使用一卡通帐号密码登录 <br/>
                          (3) 管理中心->就业管理->填写毕业生去向 <br/>
                          (4) 生源地就业主管部门必须填写，有列表可查询(上海籍学生除外) <br/>
                          (5) 电子版提交完成后，将由工作人员鉴证 <br/>
                      窗口电话：021-66135238`
          },
          {
            name: '成绩单补办',
            detail: `  全国大学生英语四、六级考试成绩单遗失申请补办 <br/>
                      上海市高校计算机等级考试成绩单遗失申请补办 <br/>
                      国家普通话水平测试证书遗失补办 <br/>
                      国家汉字应用水平测试成绩单补办 <br/>
                      以上成绩单遗失补办可于校本部A400学生服务中心11号窗口进行咨询(周一有老师值班): <br/>
                      电话: 021-66135319 <br/>
                      办理请至行政楼401找相关老师<br/>
                      电话: 66132131`
          },
          {
            name: '团组织关系转接',
            detail: ` <br/>
                      前往校本部A400学生服务中心16号窗口办理<br/>
                      窗口电话: 021-66131396 <br/>`
          },
          {
            name: '困难生认定',
            detail: ` 前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          },
          {
            name: '绿色通道',
            detail: `   前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          },
          {
            name: '国家助学贷款',
            detail: ` 前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          },
          {
            name: '助学金',
            detail: ` 前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          },
          {
            name: '临时困难补助',
            detail: ` 前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          },
          {
            name: '慈善爱心屋',
            detail: ` 前往C楼车库慈善爱心屋办理<br/>
                      电话: 021-66135120 <br/>`
          },
          {
            name: '勤工助学',
            detail: ` 前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          },
          {
            name: '素质拓展训练营',
            detail: `  前往校本部A400学生服务中心8号窗口办理<br/>
                      窗口电话: 021-66134737 <br/>`
          }
        ],
        [
          {
            name: '南区场地预约',
            detail: `  请前往成就系统上预约`
          },
          {
            name: 'A400北区场地预约',
            detail: ` 至学生服务中心官网下载打印场地预约表，填写好后经负责教师签字盖章，交至A400前台。<br/>
                      前台电话:021-66131186<br/>
                      可打电话或直接前往A400前台进行预约`
          },
          {
            name: '校内活动场地审批',
            detail: ` 前往校本部A400学生服务中心16号窗口办理<br/>
                      窗口电话: 021-66131396 <br/>`
          }
        ]
      ]
    }
  }
}
</script>

<style>

</style>
